import { Swiper, SwiperSlide } from "swiper/react";

import { Blog } from "@/types/blog.type";
import { BlogDetails } from "./blog-detail";
import { FreeMode, Scrollbar, Mousewheel } from "swiper/modules";

import "swiper/css";
import "swiper/css/free-mode";
import "swiper/css/scrollbar";

export const BlogSlider: React.FC = () => {
  const blogs: Blog[] = [
    {
      id: 1,
      title: "بهترین شهرها برای ماه عسل کدامند؟",
      image: "/images/hamedan.jpg",
      content:
        "ورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم",
    },
    {
      id: 2,
      title: "هتل اسپیناس پالاس تهران چه خدماتی دارد؟",
      image: "/images/spinas.jpg",
      content:
        "ورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم",
    },
    {
      id: 3,
      title: "اتاق‌های 5 ستاره چه ویژگی‌هایی دارند؟",
      image: "/images/room.jpg",
      content:
        "ورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم",
    },
    {
      id: 4,
      title: "بهترین شهرها برای ماه عسل کدامند؟",
      image: "/images/hamedan.jpg",
      content:
        "ورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم",
    },
    {
      id: 5,
      title: "بهترین شهرها برای ماه عسل کدامند؟",
      image: "/images/room.jpg",
      content:
        "ورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم",
    },
    {
      id: 6,
      title: "بهترین شهرها برای ماه عسل کدامند؟",
      image: "/images/room.jpg",
      content:
        "ورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم",
    },
    {
      id: 7,
      title: "بهترین شهرها برای ماه عسل کدامند؟",
      image: "/images/room.jpg",
      content:
        "ورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم",
    },
    {
      id: 8,
      title: "بهترین شهرها برای ماه عسل کدامند؟",
      image: "/images/room.jpg",
      content:
        "ورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم",
    },
    {
      id: 9,
      title: "بهترین شهرها برای ماه عسل کدامند؟",
      image: "/images/room.jpg",
      content:
        "ورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم",
    },
    {
      id: 10,
      title: "بهترین شهرها برای ماه عسل کدامند؟",
      image: "/images/room.jpg",
      content:
        "ورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم لورم اپیسوم",
    },
  ];
  return (
    <Swiper
      className="container flex justify-center items-center h-[480px] mb-20"
      direction={"vertical"}
      spaceBetween={7}
      slidesPerView={2.3}
      freeMode={true}
      scrollbar={true}
      mousewheel={true}
      modules={[FreeMode, Scrollbar, Mousewheel]}
      breakpoints={{
        0: {
          slidesPerView: 1,
        },
        480: {
          slidesPerView: 2,
          spaceBetween: 5,
        },
        768: {
          slidesPerView: 3,
          spaceBetween: 10,
        },
        1024: {
          slidesPerView: 3,
          spaceBetween: 10,
        },
      }}
    >
      <div className="flex justify-center items-center">
        {blogs.map((blog) => (
          <SwiperSlide key={blog.id}>
            <div className="pb-6 pr-4 pl-4">
              <div className="rounded-md pb-6 flex justify-center items-center cursor-pointer">
                <BlogDetails
                  title={blog.title}
                  image={blog.image}
                  content={blog.content}
                  id={blog.id}
                />
              </div>
            </div>
          </SwiperSlide>
        ))}
      </div>
    </Swiper>
  );
};
